src/InformationRegisters/onyx_ЖурналРаботыСAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>onyx_ЖурналРаботыСAPI</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_ТипЗапроса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_ТипОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/onyx_ЖурналРаботыСAPI/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Публичный программный интерфейс

// Записывает запись в журнал работы с API.
// Параметры:
//   ПараметрыЗаписи - Структура - параметры записи, должна содержать:
//     Ответ - Структура - результат HTTP-запроса
//     ТипЗапроса - ПеречислениеСсылка.onyx_ТипЗапроса (необязательный)
//     ТипОперации - ПеречислениеСсылка.onyx_ТипОперации (необязательный)
//     Пользователь - UUID - идентификатор пользователя (необязательный)
Процедура ЗаписатьЗапись(ПараметрыЗаписи) Экспорт
	
	Ответ = ПараметрыЗаписи.Ответ;
	ТипЗапроса = ПараметрыЗаписи.ТипЗапроса;
	ТипОперации = ПараметрыЗаписи.ТипОперации;
	
	Пользователь = Неопределено;
	Если ПараметрыЗаписи.Свойство("Пользователь") Тогда
		Пользователь = ПараметрыЗаписи.Пользователь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПолучитьКлючПользователя();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.onyx_ЖурналРаботыСAPI.СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДатаСеанса();
	Если ЗначениеЗаполнено(Пользователь) Тогда
		Запись.Пользователь = Пользователь;
	КонецЕсли;
	Запись.ТипОперации = ТипОперации;
	Запись.ТипЗапроса = ТипЗапроса;
	Запись.URL = УсечьСтроку(Ответ.URL, MaxJournalUrlLength());
	Запись.КодСостояния = Ответ.СтатусКод;
	Запись.Результат = УсечьСтроку(Ответ.ТекстОтвета, MaxJournalResponseLength());
	
	// Получаем описание ошибки, если запрос неуспешен
	ОписаниеОшибки = "";
	Если Не Ответ.Успех Тогда
		ОписаниеОшибки = ПолучитьОписаниеОшибки(Ответ);
	КонецЕсли;
	Запись.Ошибка = УсечьСтроку(ОписаниеОшибки, MaxJournalErrorLength());
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Частные процедуры и функции

// Возвращает уникальный идентификатор текущего пользователя.
// Возвращаемое значение:
//   UUID - уникальный идентификатор пользователя или Неопределено.
Функция ПолучитьКлючПользователя()
	
	Пользователь = Неопределено;
	Если Метаданные.ПараметрыСеанса.Найти("ТекущийПользователь") <> Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ТипПользователя = ТипЗнч(Пользователь);
	Если ТипПользователя = Тип("СправочникСсылка.Пользователи")
		ИЛИ ТипПользователя = Тип("Пользователь") Тогда
		Возврат Пользователь.УникальныйИдентификатор();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Усекает строку до указанной максимальной длины.
// Параметры:
//   ЗначениеСтроки - Строка - исходная строка.
//   МаксимальнаяДлина - Число - максимальная длина.
// Возвращаемое значение:
//   Строка - усеченная строка.
Функция УсечьСтроку(ЗначениеСтроки, МаксимальнаяДлина)
	
	Если ПустаяСтрока(ЗначениеСтроки) Тогда
		Возврат "";
	КонецЕсли;
	
	Если СтрДлина(ЗначениеСтроки) <= МаксимальнаяДлина Тогда
		Возврат ЗначениеСтроки;
	КонецЕсли;
	
	Возврат Лев(ЗначениеСтроки, МаксимальнаяДлина);
	
КонецФункции

// Возвращает описание ошибки из ответа API.
// Параметры:
//   Ответ - Структура - результат HTTP-запроса.
// Возвращаемое значение:
//   Строка - описание ошибки.
Функция ПолучитьОписаниеОшибки(Ответ)
	
	Сообщение = НСтр("ru='HTTP '") + Строка(Ответ.СтатусКод);
	
	Если ЗначениеЗаполнено(Ответ.Данные) Тогда
		ТипДанных = ТипЗнч(Ответ.Данные);
		Если ТипДанных = Тип("Структура") ИЛИ ТипДанных = Тип("Соответствие") Тогда
			Сообщение = ДобавитьДанныеСтруктуры(Сообщение, Ответ.Данные);
		ИначеЕсли ТипДанных = Тип("Массив") Тогда
			Сообщение = ДобавитьДанныеМассива(Сообщение, Ответ.Данные);
		Иначе
			Сообщение = ДобавитьДанныеЗначения(Сообщение, Ответ.Данные);
		КонецЕсли;
	Иначе
		Если Не ПустаяСтрока(Ответ.ТекстОтвета) Тогда
			Сообщение = Сообщение + Символы.ПС + Ответ.ТекстОтвета;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

// Добавляет части сообщения на основании структуры ответа.
// Параметры:
//   ИсходноеСообщение - Строка - текст, к которому добавляются детали.
//   ДанныеОшибки - Структура - структура с полями error/message/details.
// Возвращаемое значение:
//   Строка - дополненное сообщение.
Функция ДобавитьДанныеСтруктуры(ИсходноеСообщение, ДанныеОшибки)
	
	ИтоговоеСообщение = ИсходноеСообщение;
	
	Если ДанныеОшибки.Свойство("error") Тогда
		ИтоговоеСообщение = ИтоговоеСообщение + ": " + Строка(ДанныеОшибки.error);
	КонецЕсли;
	
	Если ДанныеОшибки.Свойство("message") Тогда
		ИтоговоеСообщение = ИтоговоеСообщение + Символы.ПС + Строка(ДанныеОшибки.message);
	КонецЕсли;
	
	Если ДанныеОшибки.Свойство("details") Тогда
		ИтоговоеСообщение = ИтоговоеСообщение + Символы.ПС + Строка(ДанныеОшибки.details);
	КонецЕсли;
	
	Возврат ИтоговоеСообщение;
	
КонецФункции

// Добавляет части сообщения на основании массива ответа.
// Параметры:
//   ИсходноеСообщение - Строка - текст, к которому добавляются элементы.
//   ДанныеОшибки - Массив - массив строк с описаниями ошибок.
// Возвращаемое значение:
//   Строка - дополненное сообщение.
Функция ДобавитьДанныеМассива(ИсходноеСообщение, ДанныеОшибки)
	
	Возврат ИсходноеСообщение + Символы.ПС + СтрСоединить(ДанныеОшибки, Символы.ПС);
	
КонецФункции

// Добавляет части сообщения на основании произвольного значения.
// Параметры:
//   ИсходноеСообщение - Строка - текст, к которому добавляется значение.
//   ДанныеОшибки - Произвольный - данные ответа.
// Возвращаемое значение:
//   Строка - дополненное сообщение.
Функция ДобавитьДанныеЗначения(ИсходноеСообщение, ДанныеОшибки)
	
	Возврат ИсходноеСообщение + Символы.ПС + Строка(ДанныеОшибки);
	
КонецФункции

Функция MaxJournalUrlLength()
	
	Возврат 200;
	
КонецФункции

Функция MaxJournalResponseLength()
	
	Возврат 500;
	
КонецФункции

Функция MaxJournalErrorLength()
	
	Возврат 500;
	
КонецФункции

#КонецОбласти

#КонецЕсли
